app/controllers/login_controller.rb

  def index
    set_valores
    @user = Usuario.new(username: 'michel.perilo', password: '33254422').save


    if request.post?
      case (params['commit'])
        when 'Entrar'
          @usuario_atual = Usuario.where(username: @valores['username']).first
---
INSERT INTO "usuarios" ("created_at", "updated_at", "username", "password") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2017-09-22 13:49:12.481825"], ["updated_at", "2017-09-22 13:49:12.481825"], ["username", "michel.perilo"], ["password", "33254422"]]
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."username" = $1 ORDER BY "usuarios"."id" ASC LIMIT $2  [["username", "michel.perilo"], ["LIMIT", 1]]